code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияКОтправке</Name>
			<Comment>EPAM объект</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИменаВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИДУведомления</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописиНаРусском</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОтчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружаетсяИзИнтернета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедкаяВалюта</Name>
					<Comment>Валюта, курс которой зависит от USD</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/CommonModules/РаботаСКурсамиВалют/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция КурсыАктуальны() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втВалюты
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.ПометкаУдаления = ЛОЖЬ
	|	И Валюты.ЗагружаетсяИзИнтернета = ИСТИНА
	|	И Валюты.РедкаяВалюта = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	втВалюты КАК Валюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО Валюты.Ссылка = КурсыВалют.Валюта
	|			И (КурсыВалют.Период = &ТекущаяДата)
	|ГДЕ
	|	КурсыВалют.Валюта ЕСТЬ NULL";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаАктуализацииКурсов());
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ДатаАктуализацииКурсов() Экспорт
	ДатаАктуализации = ТекущаяДатаСеанса();
	Если Час(ДатаАктуализации) >= 12 Тогда
		ДатаАктуализации = ДатаАктуализации + 24 * 60 * 60; // После 12:00 могут быть доступны курсы на завтра
	КонецЕсли;
	Возврат НачалоДня(ДатаАктуализации);
КонецФункции

Процедура ОбновитьСписокВалют(СписокВалют) Экспорт
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаАктуализации", ДатаАктуализацииКурсов());
	СтруктураПараметров.Вставить("ПоРедкимВалютам", Ложь);
	ЗаполнитьСписокВалют(СписокВалют, СтруктураПараметров);
КонецПроцедуры

Процедура УстановитьПериодЗагрузки(СписокВалют, НачДата, КонДата) Экспорт 
	
	НачДата = ТекущаяДатаСеанса();
	КонДата = ДатаАктуализацииКурсов();
	
	НачалоПредыдущегоМесяца = ДобавитьМесяц(НачалоМесяца(НачДата), -1);
	Для Каждого Строка Из СписокВалют Цикл
		Если Строка.Загружать И Строка.ДатаКурса >= НачалоПредыдущегоМесяца И Строка.ДатаКурса < НачДата Тогда
			НачДата = Строка.ДатаКурса;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УведомитьОНезагруженныхКурсах(СписокВалют) Экспорт
	
	ОбновитьСписокВалют(СписокВалют);
	
	Незагруженные = Новый СписокЗначений;
	ТекущаяДата = ДатаАктуализацииКурсов();
	Для Каждого Строка Из СписокВалют Цикл
		Если Строка.ДатаКурса < ТекущаяДата Тогда
			Незагруженные.Добавить(Строка.Валюта);
		КонецЕсли;
	КонецЦикла;
	
	Если Незагруженные.Количество() > 0 Тогда
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.НастройкаУведомленийОКурсахВалют;
		НастройкиОтправки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
		Если Не ЗначениеЗаполнено(НастройкиОтправки) Тогда
			ЗаписьЖурналаРегистрации("Не заполнены параметры внешнего источника", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегламентныеЗадания.ЗагрузкаКурсовВалют, ВнешнийИсточник, Незагруженные);
			Возврат;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Не удалось загрузить курсы валют", УровеньЖурналаРегистрации.Предупреждение, , , Незагруженные);
		
		ТемаПисьма = "Не удалось загрузить курсы валют";
		ТекстПисьма = "Курсы следующих валют неактуальны: " + Незагруженные;
		
		СформироватьУведомлениеКОтправке(НастройкиОтправки, ТемаПисьма, ТекстПисьма, ВажностьИнтернетПочтовогоСообщения.Обычная);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОповеститьОбАктуальностиКурсовВалют() Экспорт
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.НастройкаУведомленийКонтроляКурсовВалют;
	НастройкиОтправки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если Не ЗначениеЗаполнено(НастройкиОтправки) Тогда
		ЗаписьЖурналаРегистрации("Не заполнены параметры внешнего источника", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегламентныеЗадания.ЗагрузкаКурсовВалют, ВнешнийИсточник);
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Контроль курсов валют в 1С:Депозитарий";
	Если КурсыАктуальны() Тогда
		ТекстУведомления = "Курсы валют актуальны";
		ТекстСМС = "Exchange rates are actual";
		ВажностьСообщения = ВажностьИнтернетПочтовогоСообщения.Обычная;
	Иначе 
		ТекстУведомления = "Курсы валют не загружены";
		ТекстСМС = "Exchange rates are not loaded";
		ВажностьСообщения = ВажностьИнтернетПочтовогоСообщения.Высокая;
	КонецЕсли;
	
	СформироватьУведомлениеКОтправке(НастройкиОтправки, ТемаПисьма, ТекстУведомления, ВажностьСообщения);
	
	ВнешнийИсточникСМС = ПланыВидовХарактеристик.ВнешниеИсточники.НастройкаСМСУведомленийКонтроляКурсовВалют;
	НастройкаСМС = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникСМС).Настройка;
	Если Не ЗначениеЗаполнено(НастройкаСМС) Тогда
		ЗаписьЖурналаРегистрации("Не заполнены параметры внешнего источника", УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегламентныеЗадания.ЗагрузкаКурсовВалют, ВнешнийИсточникСМС);
	Иначе 
		УведомленияСМС.ОтправитьСМСУведомление(НастройкаСМС, ТекстСМС);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает новую таблицу значений для курсов валют
// Возвращаемое значение:
//  НоваяТаблица - ТаблицаЗначений - пустая таблица значений
Функция НоваяТаблицаЗначенийПоКурсамВалют() Экспорт
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("ДатаКурса", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	НоваяТаблица.Колонки.Добавить("КодВалюты", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3)));
	НоваяТаблица.Колонки.Добавить("Курс",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 4, ДопустимыйЗнак.Неотрицательный)));
	НоваяТаблица.Колонки.Добавить("Кратность",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Возврат НоваяТаблица;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьСписокВалют(СписокВалют, СтруктураПараметров)
	
	СписокВалют.Очистить();
	
	МакетОКВ = Справочники.Валюты.ПолучитьМакет("КлассификаторВалют");
	ОбластьКоды = МакетОКВ.Область("КодЧисловой");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", СтруктураПараметров.ДатаАктуализации);
	Запрос.УстановитьПараметр("ПоРедкимВалютам", СтруктураПараметров.ПоРедкимВалютам);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Код КАК Код,
	|	Валюты.Ссылка КАК Валюта,
	|	КурсыВалют.Период КАК ДатаКурса,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалют
	|		ПО Валюты.Ссылка = КурсыВалют.Валюта
	|ГДЕ
	|	Валюты.ПометкаУдаления = ЛОЖЬ
	|	И Валюты.ЗагружаетсяИзИнтернета = ИСТИНА
	|	И Валюты.РедкаяВалюта = &ПоРедкимВалютам";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденнаяОбласть = МакетОКВ.НайтиТекст(Выборка.Код, , ОбластьКоды);
		Если НайденнаяОбласть = Неопределено Или НайденнаяОбласть.Верх = 2 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СписокВалют.Добавить(), Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьУведомлениеКОтправке(НастройкиОтправки, ТемаПисьма, ТекстУведомления, ВажностьСообщения)
	
	Вложения = Новый Соответствие;
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена"		, НастройкиОтправки);
	ПараметрыУведомления.Вставить("ТемаПисьма"			, ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма"			, ТекстУведомления);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма"		, ТипТекстаПочтовогоСообщения.ПростойТекст);
	ПараметрыУведомления.Вставить("Кодировка"			, "UTF-8");
	ПараметрыУведомления.Вставить("Вложения"			, Вложения);
	ПараметрыУведомления.Вставить("Важность"			, ВажностьСообщения);
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
	
КонецПроцедуры
